# Session 8

Feature Engineering

In [1]:
import pandas as pd

row_1 = {'City': 'Alex', 'Pop': 655500 , 'Area' : 2500}    # Column name and value
row_2 = {'City': 'Mecca', 'Pop': 254400 , 'Area' : 9820}    # Column name and value


data = pd.DataFrame([row_1, row_2])
data

    City     Pop  Area
0   Alex  655500  2500
1  Mecca  254400  9820

In [2]:
data['Density'] =  data['Pop'] / data['Area']
data

    City     Pop  Area     Density
0   Alex  655500  2500  262.200000
1  Mecca  254400  9820   25.906314

This shows a preview of the straightforward syntax of element-by-element arithmetic between ``Series`` objects; we'll dig into this further in [Operating on Data in Pandas](03.03-Operations-in-Pandas.ipynb).

With this picture in mind, many familiar array-like observations can be done on the ``DataFrame`` itself.
For example, we can transpose the full ``DataFrame`` to swap rows and columns:

In [5]:
data.T #transpose

              0          1
City       Alex      Mecca
Pop      655500     254400
Area       2500       9820
Density   262.2  25.906314

When it comes to indexing of ``DataFrame`` objects, however, it is clear that the dictionary-style indexing of columns precludes our ability to simply treat it as a NumPy array.
In particular, passing a single index to an array accesses a row:

In [6]:
data

    City     Pop  Area     Density
0   Alex  655500  2500  262.200000
1  Mecca  254400  9820   25.906314

In [7]:
data['Area']

0    2500
1    9820
Name: Area, dtype: int64

**Task**

Create Dataframe with 5 rows with 3 columns  

1- first column names of students

2- second column is age of them

3- GPA

what to do ?

    1- create new column with multiply age by 5

**Bonus**

    2- make columns name is index
    3- call any student by his name to print rest of data

In [ ]:
import pandas as pd

In [9]:
row_1 = {'Name': 'Ahmed',   'Age': 25 , 'GPA' : 4}    # Column name and value
row_2 = {'Name': 'Mahmoud', 'Age': 43 , 'GPA' : 2.5}    # Column name and value
row_3 = {'Name': 'Sara',    'Age': 33 , 'GPA' : 3}

data = pd.DataFrame([row_1, row_2,row_3])
data

      Name  Age  GPA
0    Ahmed   25  4.0
1  Mahmoud   43  2.5
2     Sara   33  3.0

In [10]:
data

      Name  Age  GPA
0    Ahmed   25  4.0
1  Mahmoud   43  2.5
2     Sara   33  3.0

In [11]:
data['age5'] = data['Age'] * 5
data

      Name  Age  GPA  age5
0    Ahmed   25  4.0   125
1  Mahmoud   43  2.5   215
2     Sara   33  3.0   165

In [12]:
data.set_index('Name',inplace=True)

In [13]:
data

         Age  GPA  age5
Name
Ahmed     25  4.0   125
Mahmoud   43  2.5   215
Sara      33  3.0   165

In [14]:
data.loc['Mahmoud']

Age      43.0
GPA       2.5
age5    215.0
Name: Mahmoud, dtype: float64

## Loc and Iloc

Because of this potential confusion in the case of integer indexes, Pandas provides some special *indexer* attributes that explicitly expose certain indexing schemes.
These are not functional methods, but attributes that expose a particular slicing interface to the data in the ``Series``.

First, the ``loc`` attribute allows indexing and slicing that always references the explicit index:

In [2]:
row_1 = {'City': 'Alex', 'Pop': 655500 , 'Area' : 2500}    # Column name and value
row_2 = {'City': 'Mecca' , 'Pop': 254400 , 'Area' : 9820}    # Column name and value


data = pd.DataFrame([row_1, row_2],
                    index=[2,5])
data

    City     Pop  Area
2   Alex  655500  2500
5  Mecca  254400  9820

In [17]:
data.loc[5] # human eye

City     Mecca
Pop     254400
Area      9820
Name: 5, dtype: object

In [18]:
data.iloc[1]  # Computer eye

City     Mecca
Pop     254400
Area      9820
Name: 5, dtype: object

In [19]:
data

    City     Pop  Area
2   Alex  655500  2500
5  Mecca  254400  9820

In [22]:
data.loc[1:5]

    City     Pop  Area
2   Alex  655500  2500
5  Mecca  254400  9820

The ``iloc`` attribute allows indexing and slicing that always references the implicit Python-style index:

In [23]:
data

    City     Pop  Area
2   Alex  655500  2500
5  Mecca  254400  9820

In [24]:
data.iloc[2]

IndexError: single positional indexer is out-of-bounds

In [25]:
data

    City     Pop  Area
2   Alex  655500  2500
5  Mecca  254400  9820

In [26]:
data.loc[5]   # take real index from my eyes

City     Mecca
Pop     254400
Area      9820
Name: 5, dtype: object

In [27]:
data.iloc[0:5] # take index from computer eyes

    City     Pop  Area
2   Alex  655500  2500
5  Mecca  254400  9820

In [28]:
data.iloc[5]

IndexError: single positional indexer is out-of-bounds

In [29]:
data.iloc[1:5]

    City     Pop  Area
5  Mecca  254400  9820

In [30]:
# data = pd.DataFrame([row_1, row_2],
#                     index=[2,5])

    City       Pop    Area  Name   Age  GPA
1   Alex  655500.0  2500.0   NaN   NaN  NaN
2  Mecca  254400.0  9820.0   NaN   NaN  NaN
4    NaN       NaN     NaN  Sara  33.0  3.0

Task

1- create dataframe 3 rows 2 columns with index  1 2 4

2- print 3rd row using two ways

In [33]:
# data = pd.DataFrame([row_1, row_2],
#                     index=[2,5])

A third indexing attribute, ``ix``, is a hybrid of the two, and for ``Series`` objects is equivalent to standard ``[]``-based indexing.
The purpose of the ``ix`` indexer will become more apparent in the context of ``DataFrame`` objects, which we will discuss in a moment.

One guiding principle of Python code is that "explicit is better than implicit."
The explicit nature of ``loc`` and ``iloc`` make them very useful in maintaining clean and readable code; especially in the case of integer indexes, I recommend using these both to make code easier to read and understand, and to prevent subtle bugs due to the mixed indexing/slicing convention.

In [34]:
data

    City     Pop  Area
2   Alex  655500  2500
5  Mecca  254400  9820

In [35]:
data.iloc[1]

City     Mecca
Pop     254400
Area      9820
Name: 5, dtype: object

In [36]:
data.loc[6]

KeyError: 6

In [37]:
data.reset_index(inplace=True)
data

   index   City     Pop  Area
0      2   Alex  655500  2500
1      5  Mecca  254400  9820

Thus for array-style indexing, we need another convention.
Here Pandas again uses the ``loc``, ``iloc``, and ``ix`` indexers mentioned earlier.
Using the ``iloc`` indexer, we can index the underlying array as if it is a simple NumPy array (using the implicit Python-style index), but the ``DataFrame`` index and column labels are maintained in the result:

In [38]:
data

   index   City     Pop  Area
0      2   Alex  655500  2500
1      5  Mecca  254400  9820

In [39]:
data.loc[5]

KeyError: 5

In [40]:
data.iloc[1]

index         5
City      Mecca
Pop      254400
Area       9820
Name: 1, dtype: object

In [45]:
row_1 = {'Name': 'Ahmed',   'Age': 25 , 'GPA' : 4}    # Column name and value
row_2 = {'Name': 'Mahmoud', 'Age': 43 , 'GPA' : 2.5}    # Column name and value
row_3 = {'Name': 'Sara',    'Age': 33 , 'GPA' : 3}

data = pd.DataFrame([row_1, row_2,row_3],index=[1,2,4])
data

      Name  Age  GPA
1    Ahmed   25  4.0
2  Mahmoud   43  2.5
4     Sara   33  3.0

In [46]:
data.iloc[ :1 , 1:3 ]  # row  ,  cols

   Age  GPA
1   25  4.0

In [47]:
data

      Name  Age  GPA
1    Ahmed   25  4.0
2  Mahmoud   43  2.5
4     Sara   33  3.0

In [48]:
data.iloc[1:4 , :2]

      Name  Age
2  Mahmoud   43
4     Sara   33

In [ ]:
# data.iloc[:3, :2]

Similarly, using the ``loc`` indexer we can index the underlying data in an array-like style but using the explicit index and column names:

In [53]:
row_1 = {'City': 'Alex', 'Pop': 655500 , 'Area' : 2500}    # Column name and value
row_2 = {'City': 'Mecca' , 'Pop': 254400 , 'Area' : 9820}    # Column name and value


data = pd.DataFrame([row_1, row_2],
                    index=[2,5])
data['Density'] =  data['Pop'] / data['Area']
data

    City     Pop  Area     Density
2   Alex  655500  2500  262.200000
5  Mecca  254400  9820   25.906314

In [54]:
data.loc[ 0:1 , :'Area'  ]  # rows   , col    # loc  take real name  last is inclusive

Empty DataFrame
Columns: [City, Pop, Area]
Index: []

In [55]:
data.loc[ 0:2 , :'Area'  ]  # rows   , col    # loc  take real name  last is inclusive

   City     Pop  Area
2  Alex  655500  2500

In [57]:
data.loc[ 2:5 , 'Area'  ]

2    2500
5    9820
Name: Area, dtype: int64

Any of the familiar NumPy-style data access patterns can be used within these indexers.
For example, in the ``loc`` indexer we can combine masking and fancy indexing as in the following:

In [58]:
data

    City     Pop  Area     Density
2   Alex  655500  2500  262.200000
5  Mecca  254400  9820   25.906314

In [61]:
data.loc[ data['Density'] > 100 , ['Pop', 'Density']  ]

      Pop  Density
2  655500    262.2

In [62]:
data.loc[ data.pop > 260000 , ['Pop', 'Density'] ]

TypeError: '>' not supported between instances of 'method' and 'int'

In [64]:
data.loc[ data['Pop'] > 260000 , ['Pop', 'Density'] ]

      Pop  Density
2  655500    262.2

In [65]:
data

    City     Pop  Area     Density
2   Alex  655500  2500  262.200000
5  Mecca  254400  9820   25.906314

Any of these indexing conventions may also be used to set or modify values; this is done in the standard way that you might be accustomed to from working with NumPy:

Task :

1- human names with salaries > 80000 

2- human with age less than 39 years

In [3]:
import pandas as pd

# Creating a DataFrame with 10 rows and 3 columns: names, salaries, and age
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Hannah', 'Ivan', 'Judy'],
    'Salary': [70000, 80000, 75000, 90000, 85000, 72000, 88000, 94000, 69000, 77000],
    'Age': [30, 40, 35, 45, 32, 38, 29, 50, 27, 42]
}

df = pd.DataFrame(data)
df

      Name  Salary  Age
0    Alice   70000   30
1      Bob   80000   40
2  Charlie   75000   35
3    David   90000   45
4      Eve   85000   32
5    Frank   72000   38
6    Grace   88000   29
7   Hannah   94000   50
8     Ivan   69000   27
9     Judy   77000   42

In [6]:
df.loc[df['Salary'] > 80000,['Name','Salary']]

     Name  Salary
3   David   90000
4     Eve   85000
6   Grace   88000
7  Hannah   94000

In [7]:
df.loc[df['Age'] < 39 ,['Name','Age']]

      Name  Age
0    Alice   30
2  Charlie   35
4      Eve   32
5    Frank   38
6    Grace   29
8     Ivan   27

In [10]:
df

      Name  Salary  Age
0    Alice   70000   30
1      Bob   80000   40
2  Charlie   75000   35
3    David   90000   45
4      Eve   85000   32
5    Frank   72000   38
6    Grace   88000   29
7   Hannah   94000   50
8     Ivan   69000   27
9     Judy   77000   42

In [11]:
df.iloc[ 3 , 1 ]

90000

In [12]:
df.iloc[ 3 , 1 ] =  100000

In [13]:
df

      Name  Salary  Age
0    Alice   70000   30
1      Bob   80000   40
2  Charlie   75000   35
3    David  100000   45
4      Eve   85000   32
5    Frank   72000   38
6    Grace   88000   29
7   Hannah   94000   50
8     Ivan   69000   27
9     Judy   77000   42

task 3

edit Salary of  Ivan to 20000

task 4

edit Age of Charile to 25

In [ ]:
data.iloc[  0 , 2]

In [ ]:
data.iloc[0, 2] = 95
data

In [ ]:
data.loc[data['pop'] >= 20000000  , : ]

To build up your fluency in Pandas data manipulation, I suggest spending some time with a simple ``DataFrame`` and exploring the types of indexing, slicing, masking, and fancy indexing that are allowed by these various indexing approaches.

Similarly, direct masking operations are also interpreted row-wise rather than column-wise:

In [14]:
df

      Name  Salary  Age
0    Alice   70000   30
1      Bob   80000   40
2  Charlie   75000   35
3    David  100000   45
4      Eve   85000   32
5    Frank   72000   38
6    Grace   88000   29
7   Hannah   94000   50
8     Ivan   69000   27
9     Judy   77000   42

In [15]:
df['Salary'] > 90000

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7     True
8    False
9    False
Name: Salary, dtype: bool

In [16]:
df[df['Salary'] > 90000 ]

     Name  Salary  Age
3   David  100000   45
7  Hannah   94000   50

In [18]:
df[df['Age'] < 35 ]

    Name  Salary  Age
0  Alice   70000   30
4    Eve   85000   32
6  Grace   88000   29
8   Ivan   69000   27

task 

get data of Alice by using masking index

print Salaries < 20000

In [19]:
df[df['Name'] == 'Alice']

    Name  Salary  Age
0  Alice   70000   30

In [20]:
df[df['Salary'] < 20000 ]

Empty DataFrame
Columns: [Name, Salary, Age]
Index: []

In [21]:
df

      Name  Salary  Age
0    Alice   70000   30
1      Bob   80000   40
2  Charlie   75000   35
3    David  100000   45
4      Eve   85000   32
5    Frank   72000   38
6    Grace   88000   29
7   Hannah   94000   50
8     Ivan   69000   27
9     Judy   77000   42

In [25]:
df['Sal_per_age'] =   list(range(1,11))     #df['Salary'] / df['Age']
df

      Name  Salary  Age  Sal_per_age
0    Alice   70000   30            1
1      Bob   80000   40            2
2  Charlie   75000   35            3
3    David  100000   45            4
4      Eve   85000   32            5
5    Frank   72000   38            6
6    Grace   88000   29            7
7   Hannah   94000   50            8
8     Ivan   69000   27            9
9     Judy   77000   42           10